w8d1/redditclone_project/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = params[:user_id] #/ current_user.id / users/user_id/subs

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Ulfds"], ["description", "fdsadfa"], ["moderator_id", 6], ["created_at", "2020-06-29 20:26:55.391193"], ["updated_at", "2020-06-29 20:26:55.391193"]]

    def show
      @post = Post.new
      @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def destroy
      @sub = current_user.subs.find_by(id: params[:id])
      if @sub && @sub.delete
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 1]]