w8d1/redditclone_project/app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "fz-tYU5RhzyhqCyBzEkXJw"], ["updated_at", "2020-06-29 19:14:58.187293"], ["id", 1]]

    def show
        @sub = Sub.new
        @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]