w6d5/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        @kitties = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        @kitty = Cat.find(params[:id])

INSERT INTO "cats" ("birth_date", "created_at", "updated_at", "color", "name", "sex", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
      @kitty = Cat.new(cat_params)
      if @kitty.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def edit
      @kitty = Cat.find(params[:id])