w6d3/routes_controller_project/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        render json: ArtworkShare.all