w6d3/routes_controller_project/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1  [["commenter_id", 13]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 6]]
SELECT "comments".* FROM "comments"
---
    def index

        if params[:user_id]
            render json: Comment.where(commenter_id: params[:user_id])
        elsif params[:artwork_id]
            render json: Comment.where(artwork_id: params[:artwork_id])
        else
            render json: Comment.all

INSERT INTO "comments" ("commenter_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter_id", 12], ["artwork_id", 5], ["body", "Interesting!"], ["created_at", "2020-06-18 18:55:19.715249"], ["updated_at", "2020-06-18 18:55:19.715249"]]
---
    def create
        comment = Comment.new(comment_params)

        if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def update
        comment = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
    def destroy
        comment = Comment.find(params[:id])

        if comment.destroy