w6d3/routes_controller_project/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "\"andy\""]]
SELECT "users".* FROM "users"
---
    def index
        if params[:username]
            render json: User.where("username ILIKE '%#{params[:username]}%'")
        else
            render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "Peter Kim"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)