w8d1/redditclone_project/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 3]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 3]]
---

<% if @sub.posts.count > 0 %>
    <ul>
        <% @sub.posts.each do |post| %>